# Дан прямоугольник, длины сторон которого равны натуральным числам А и В.
# Составить функцию, которая будет находить на сколько квадратов можно разрезать
# данный прямоугольник, если от него каждый раз отрезать квадрат наибольшей
# площади.
Дан целочисленный список размера N. Найти максимальное количество его
одинаковых элементов.
3. Дан список размера N, все элементы которого, кроме одного, упорядочены по
убыванию. Сделать список упорядоченным, переместив элемент, нарушающий
упорядоченность, на новую позицию.
